---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SharedCoordinatesFailures.CannotAcquireCoordinatesFromLinkWithScaledLocation
source: html/75d41cbe-94cf-6b79-06dd-24ed24f6533a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SharedCoordinatesFailures.CannotAcquireCoordinatesFromLinkWithScaledLocation Property

Can't acquire coordiantes from a link that has a scaled location.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotAcquireCoordinatesFromLinkWithScaledLocation { get; }
```